microchip-pic-avr-examples/dspic33ck-power-dcdc-dual-active-bridge-development-platform/dspic33ck-dab.X/sources/pwrctrl/pwrctrl_isr_extension.c
    }

    // Execute the Current Loop Control
    if(dab.ILoop.Enable == true)
    {
        DPD_TP31_SetHigh();
        //Bit-shift value used to perform input value normalization
        dab.ILoop.Feedback = dab.Data.ISecAverageRectified << 3;
        //adaptive gain factor
        IMC_2p2z.KfactorCoeffsB = dab.ILoop.AgcFactor;
        //refresh limits
        IMC_2p2z.maxOutput =  0x7FFF;

        
        
        
        
        
        if(dab.PowerDirection == PWR_CTRL_CHARGING)
        { 
            // Mixing stage from voltage loop 10KHz
            uint32_t RefBuf = (uint32_t)(dab.ILoop.Reference) * 
                    (uint32_t)(dab.VLoop.Output & 0x7FFF);
            uint16_t ILoopReference = (uint16_t)(RefBuf >> 12); 

            // Mixing stage from power loop 10KHz
            RefBuf =  (uint32_t)ILoopReference * (uint32_t)(dab.PLoop.Output & 0x7FFF);  
            ILoopReference = (int16_t)(RefBuf >> 15);       

            // Basic clamping in rising direction, in case of  Iloop or Vloop overshoot during large load step. 
            if( dab.Data.ISecAverageRectified >  (dab.ILoop.Reference + ISEC_LOAD_STEP_CLAMP)) 
            {
                 XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, 0, &dab.ILoop.Output); //force I ref to 0
            }
            else
                if(vSecAveraging.AverageValue > (dab.VLoop.Reference + VSEC_LOAD_STEP_CLAMP))
                {    
                    XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, 0, &dab.ILoop.Output);//force I ref to 0
                }
                else
                {
                    XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, ILoopReference, &dab.ILoop.Output);   
                }    
        }
        
        
        
        
        if(dab.PowerDirection == PWR_CTRL_DISCHARGING)
        {
                 //tbd  
            
            // Mixing stage from voltage loop 10KHz
            uint32_t RefBuf = (uint32_t)(dab.ILoop.Reference) * 
                    (uint32_t)(dab.VLoop.Output & 0x7FFF);
            uint16_t ILoopReference = (uint16_t)(RefBuf >> 12); 

            // Mixing stage from power loop 10KHz
            RefBuf =  (uint32_t)ILoopReference * (uint32_t)(dab.PLoop.Output & 0x7FFF);  
            ILoopReference = (int16_t)(RefBuf >> 15);       

            // Basic clamping in rising direction, in case of  Iloop or Vloop overshoot during large load step. 
            if( dab.Data.ISecAverageRectified >  (dab.ILoop.Reference + ISEC_LOAD_STEP_CLAMP)) 
            {
                 XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, 0, &dab.ILoop.Output); //force I ref to 0
            }
            else
                if(vSecAveraging.AverageValue > (dab.VLoop.Reference + VSEC_LOAD_STEP_CLAMP))
                {    
                    XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, 0, &dab.ILoop.Output);//force I ref to 0
                }
                else
                {
                    XFT_SMPS_Controller2P2ZUpdate(&IMC_2p2z, &dab.ILoop.Feedback, ILoopReference, &dab.ILoop.Output);   
                }   
            
            
        }
        
        
        
            if(0)
            {    
                //plant measurement K factor 4  
//                dab.VLoop.Output = vPrimAveraging.AverageValue << 2; 
//                dab.VLoop.Output = dab.VLoop.Reference << 2; 
                if ((dab.ILoop.Reference + 10 )> dab.Data.ISecAverageRectified)
                {
                   dab.ILoop.Output = 100 * (dab.ILoop.Reference - dab.Data.ISecAverageRectified);// << 2; 
                }
                else//current overshoot, clip
                {
                    dab.ILoop.Output = 20;
                }

            }
        
        
        
        // Control loop output copied to control phase
        dab.Pwm.ControlPhase = (((uint32_t)(dab.Pwm.ControlDutyCycle) * 
                (uint32_t)dab.ILoop.Output) >> 15); //range 0..180
        dab.Pwm.ControlPhase += MIN_PHASE_SHIFTED_PULSE;//32;//dab.Pwm.DeadTimeLow;
        
        // Clamping value of control phase
        if(dab.Pwm.ControlPhase > (dab.Pwm.ControlDutyCycle - MIN_PHASE_SHIFTED_PULSE))
            dab.Pwm.ControlPhase = dab.Pwm.ControlDutyCycle - MIN_PHASE_SHIFTED_PULSE;
//        // Clamping value of control phase
//        else if(dab.Pwm.ControlPhase < dab.Pwm.DeadTimeLow) 
//            dab.Pwm.ControlPhase = dab.Pwm.DeadTimeLow;  
         else if(dab.Pwm.ControlPhase < MIN_PHASE_SHIFTED_PULSE) 
            dab.Pwm.ControlPhase = MIN_PHASE_SHIFTED_PULSE;  
        
        
        DPD_TP31_SetLow();
    }
}

/*******************************************************************************
 * @ingroup pwrctrl-isr
 * @brief Updates the Adaptive gain for the power converter control loop 
 * @return void
 * 
 * @details AGC is a specific method for tuning the overall feedback loop gain 
 * during runtime. This function handles the calculation of the gain at a particular 
 * input voltage. AGC is active when it is above the minimum AGC input voltage.
 *********************************************************************************/
static void PwrCtrl_AdaptiveGainUpdate(void)
{
   
    if(dab.PowerDirection == PWR_CTRL_CHARGING)
    { 
        // Calculate the primary voltage in terms of Volts
        uint16_t DAB_PrimaryVoltage = __builtin_divud((vPrimAveraging.AverageValue * VPRI_SCALER), VPRI_FACTOR);
        
        // Apply AGC when primary voltage is greater than the minimum VIN AGC threshold 
        if(DAB_PrimaryVoltage > AGC_MINIMUM_VIN_THRESHOLD)
            dab.ILoop.AgcFactor = (int16_t) (0x7FFF & 
                    __builtin_divud(AGC_VOLTAGE_FACTOR, DAB_PrimaryVoltage));
        else // AGC is not active
            dab.ILoop.AgcFactor = 0x7FFF;
        
              
    #if(ENABLE_VLOOP_AGC == true)
        if(dab.ILoop.Reference > AGC_MINIMUM_CURRENT_THRESHOLD)
            dab.VLoop.AgcFactor = (int16_t) (0x7FFF & 
                    __builtin_divud(AGC_CURRENT_FACTOR, dab.ILoop.Reference)); 
        else // AGC is not active
            dab.VLoop.AgcFactor = 0x7FFF;
    #endif
    }
    
    // Reserved for future Development
    if(dab.PowerDirection == PWR_CTRL_DISCHARGING)
    { 
        
